"CIAdditionCompositing" = "Добавление";
"CIAffineClamp" = "Аффинировать фиксацию";
"CIAffineTile" = "Аффинирвать мозаику";
"CIAffineTransform" = "Аффинировать трансформ";
"CIBarsSwipeTransition"="Переход вихревое движение пластин";
"CIBlendWithMask" = "Смешать с маской";
"CIBloom" = "Ореол";
"CIBoxBlur"="Блоковое размытие";
"CIBumpDistortion" = "Бугристость";
"CIBumpDistortionLinear"="Бугристое линейное искажение";
"CICMYKHalftone" = "Полутон CMYK";
"CICheckerboardGenerator" = "Шахматный порядок";
"CICircleSplashDistortion" = "Искажение типа «круги на воде»";
"CICircularScreen" = "Круговой экран";
"CICircularWrap" = "Искажение «круговое заворачивание»";
"CIColorControls" = "Элементы управления цветом";
"CIColorCube" = "Цветовой куб";
"CIColorInvert" = "Инверсия цвета";
"CIColorMap" = "Карта цветов";
"CIColorMatrix" = "Цветовая матрица";
"CIColorMonochrome" = "Монохромный цвет";
"CIColorPosterize" = "Постеризовать цвет";
"CIComicEffect" = "Эффект комикса";
"CIConstantColorGenerator" = "Постоянный цвет";
"CICopyMachineTransition" = "Копировальный аппарат";
"CICrop" = "Обрезка";
"CICrystallize" = "Кристаллизация";
"CIDiscBlur"="Дисковое размытие";
"CIDisintegrateWithMaskTransition" = "Разложение с маской";
"CIDisplacementDistortion" = "Искажение со смещением";
"CIDissolveTransition" = "Растворение";
"CIDotScreen" = "Точечный растр";
"CIEdges" = "Цветной контур";
"CIEdgeWork" = "Ч/б контур";
"CIEightfoldReflectedTile"="Восьмикратно отраженная мозаика";
"CIExposureAdjust" = "Установка экспозиции";
"CIFalseColor" = "Дополнительный цвет";
"CIFastBoxBlur" = "Быстрое блоковое размытие";
"CIFastDiscBlur" = "Быстрое дисковое размытие";
"CIFlashTransition" = "Флэш";
"CIFourfoldReflectedTile"="Четырехкратно отраженная мозаика";
"CIFourfoldRotatedTile"="Четырехкратно вращаемая мозаика";
"CIFourfoldTranslatedTile"="Четырехкратно перемещенная мозаика";
"CIGammaAdjust" = "Настройка Гамма";
"CIGaussianBlur" = "Гауссова размытость";
"CIGaussianGradient" = "Гауссов градиент";
"CIGlassDistortion" = "Искажение типа «стекло»";
"CIGlassLozenge" = "Ромбовидное стекло";
"CIGlideReflectedTile"="Плавная отраженная мозаика";
"CIGloom" = "Затемнение";
"CIHatchedScreen" = "Заштрихованный экран";
"CIHeightFieldFromMask" = "Поле высоты из маски";
"CIHexagonalPixellate"="Шестиугольная пикселизация";
"CIHoleDistortion" = "Искажение «отверстие»";
"CIHueAdjust" = "Регулировка оттенка";
"CIKaleidoscope" = "Калейдоскоп";
"CILanczosScaleTransform" = "Трансформ масштаба Lanczos";
"CILenticularHaloGenerator" = "Двояковыпуклое гало";
"CILineOverlay" = "Линейное покрытие";
"CILineScreen" = "Линейный экран";
"CILinearGradient" = "Линейный градиент";
"CIMaskToAlpha" = "Маска к Alpha";
"CIMaximumCompositing" = "Максимум";
"CIMedianFilter" = "Медиана";
"CIMinimumCompositing" = "Минимум";
"CIModTransition" = "Режим";
"CIMotionBlur" = "Размывание движения";
"CIMultiplyCompositing" = "Умножить";
"CINoiseReduction" = "Уменьшение шума";
"CIOpTile" = "Op мозаика";
"CIPageCurlTransition" = "Волнистость страницы";
"CIParallelogramTile" = "Мозаика из параллелограммов";
"CIPerspectiveTile" = "Перспективная мозаика";
"CIPerspectiveTransform" = "Перспективное преобразование";
"CIPinchDistortion" = "Сужение экрана";
"CIPixellate" = "Пикселизация";
"CIPointillize" = "Пойнтиллизация";
"CIRadialGradient" = "Радиальный градиент";
"CIRandomGenerator" = "Генератор случайных чисел";
"CIRippleTransition" = "Рябь";
"CISepiaTone" = "Оттенок сепии";
"CIShadedMaterial" = "Затененный материал";
"CISharpenLuminance" = "Повышение резкости яркого";
"CISixfoldReflectedTile"="Шестикратно отраженная мозаика";
"CISixfoldRotatedTile"="Шестикратно вращаемая мозаика";
"CISourceAtopCompositing" = "Источник наверху";
"CISourceInCompositing" = "Источник внутри";
"CISourceOutCompositing" = "Источник снаружи";
"CISourceOverCompositing" = "Источник выше";
"CISpotColor" = "Цвет ореола";
"CISpotLight" = "Направленная освещенность";
"CIStarShineGenerator" = "Звездное сияние";
"CIStripesGenerator" = "Полосы";
"CISunbeamsGenerator" = "Солнечные лучи";
"CISwipeTransition" = "Вихревое движение";
"CITorusLensDistortion" = "Искажение «тороидальная линза»";
"CITriangleTile" = "Треугольная мозаика";
"CITwelvefoldReflectedTile"="Двенадцатикратно отраженная мозаика";
"CITwirlDistortion" = "Вихреобразное искажение";
"CIUnsharpMask" = "Снизить резкость маски";
"CIVortexDistortion" = "Вихревое искажение";
"CIWhitePointAdjust" = "Регулировка белой точки";
"CIZoomBlur" = "Размытость увеличения";
"CIColorBlendMode" = "Режим смешивания цветов";
"CIColorBurnBlendMode" = "Режим смешивания «дополнительное экспонирование»";
"CIColorDodgeBlendMode" = "Режим смешивания «оттенение цветом»";
"CIDarkenBlendMode" = "Режим смешивания с затемнением";
"CIDifferenceBlendMode" = "Режим разностного смешивания";
"CIExclusionBlendMode" = "Режим смешивания с исключением";
"CIHardLightBlendMode" = "Режим смешивания с жестким освещением";
"CIHueBlendMode" = "Режим смешивания «оттенок»";
"CILightenBlendMode" = "Режим смешивания «осветление»";
"CILuminosityBlendMode" = "Режим смешивания «яркость света»";
"CIMultiplyBlendMode" = "Режим смешивания «умножение»";
"CIOverlayBlendMode" = "Режим смешивания «графическая накладка»";
"CISaturationBlendMode" = "Режим смешивания «насыщение»";
"CIScreenBlendMode" = " Режим смешивания «экранный»";
"CISoftLightBlendMode" = "Режим смешивания «мягкий свет» ";
"CIAreaHistogram" = "Гистограмма участка";
"CIAreaMaximum" = "Максимальное значение участка";
"CIAreaMinimum" = "Минимальное значение участка";
"CIAreaMaximumAlpha" = "Минимальное значение Alpha участка";
"CIAreaMinimumAlpha" = "Минимальное значение Alpha участка";
"CIAreaAverage" = "Среднее значение участка";
"CIRowAverage" = "Среднее значение ряда";
"CIColumnAverage" = "Среднее значение колонки";
"CIMinimumComponent" = "Минимальный компонент";
"CIMaximumComponent" = "Максимальный компонент";
